In [2]:
import pandas as pd

In [3]:
df= pd.read_excel('../cleaned_data/bangalore_cars_cleaned.xlsx')

In [5]:
df = df[['Listed_Price', 'Actual_Price', 'Price_Saving_Amount']]

In [6]:
df.head()

  Listed_Price Actual_Price  Price_Saving_Amount
0     ₹ 4 Lakh          NaN                  NaN
1  ₹ 8.11 Lakh          NaN                  NaN
2  ₹ 5.85 Lakh          NaN                  NaN
3  ₹ 4.62 Lakh          NaN                  NaN
4  ₹ 7.90 Lakh          NaN                  NaN

In [9]:
df.shape

(1481, 3)

In [7]:
df['Listed_Price'].isna().sum()

np.int64(0)

In [8]:
df['Actual_Price'].isna().sum()

np.int64(1170)

In [10]:
df['Price_Saving_Amount'].isna().sum()

np.int64(1481)

In [18]:
df['Listed_Price'] = df['Listed_Price'].str.replace('₹', '', regex=False).str.replace(',','', regex=False).str.replace('Crore', '', regex=False).str.replace(',','', regex=False).str.strip()
df['Listed_Price'] = df['Listed_Price'].astype(float) * 100000
df['Listed_Price'].head()

0    400000.0
1    811000.0
2    585000.0
3    462000.0
4    790000.0
Name: Listed_Price, dtype: float64

In [19]:
df['Listed_Price'].mean()

np.float64(73260949.35854153)

In [22]:
df['Actual_Price'] = df['Actual_Price'].str.replace('₹', '', regex=False).str.replace(',','', regex=False).str.replace('Crore', '', regex=False).str.replace('Lakh','', regex=False).str.strip()
df['Actual_Price'] = df['Actual_Price'].astype(float) * 100000
df['Actual_Price'].head()

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: Actual_Price, dtype: float64

In [23]:
df['Actual_Price'].mean()

np.float64(622565.9163987138)

In [24]:
# Function to calculate the difference excluding null values
import numpy as np
def calculate_difference(row):
    if pd.notnull(row['Actual_Price']) and pd.notnull(row['Listed_Price']):
        return row['Actual_Price'] - row['Listed_Price']
    else:
        return np.nan

# Apply the function to calculate the difference
df['Difference'] = df.apply(calculate_difference, axis=1)

In [28]:
mean_diff = df['Difference'].mean()

In [29]:
df['Actual_Price'].fillna(df['Listed_Price'] + mean_diff)

0       4.270932e+05
1       8.380932e+05
2       6.120932e+05
3       4.890932e+05
4       8.170932e+05
            ...
1476    1.676093e+06
1477    3.570932e+05
1478    4.520932e+05
1479    7.770932e+05
1480    7.020932e+05
Name: Actual_Price, Length: 1481, dtype: float64

In [30]:
df.head()

   Listed_Price   Actual_Price  Price_Saving_Amount  Difference
0      400000.0  427093.247588                  NaN         NaN
1      811000.0  838093.247588                  NaN         NaN
2      585000.0  612093.247588                  NaN         NaN
3      462000.0  489093.247588                  NaN         NaN
4      790000.0  817093.247588                  NaN         NaN

In [31]:
df.drop(columns='Difference', inplace=True)

In [32]:
df.head()

   Listed_Price   Actual_Price  Price_Saving_Amount
0      400000.0  427093.247588                  NaN
1      811000.0  838093.247588                  NaN
2      585000.0  612093.247588                  NaN
3      462000.0  489093.247588                  NaN
4      790000.0  817093.247588                  NaN

In [34]:
mean_difference = (df['Listed_Price'] - df['Actual_Price']).mean()

In [35]:
mean_difference

np.float64(-27093.24758842171)